# RebarHandleNameData Properties

---
The RebarHandleNameData type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
RebarHandleNameData Class
Autodesk.Revit.DB.Structure Namespace